In [2]:
import pandas as pd
import numpy as np
# a pandas series is like a column in a table

In [3]:
#series from a list
country = ['USA', 'Canada', 'Mexico']
pd.Series(country)

0       USA
1    Canada
2    Mexico
dtype: object

In [4]:
#integers 
numbers = [1, 2, 3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [5]:
# custom indexing 
number = [99,98,97]
subjects = ['Math', 'English', 'History']

pd.Series(number, index=subjects)

Math       99
English    98
History    97
dtype: int64

In [9]:
#setting a custom name for the series
marks = pd.Series(number, index=subjects, name='Grades for x')

Series from dictonary

In [10]:
dict = {'Math': 99, 'English': 98, 'History': 97}
pd.Series(dict,name ='Grades for x')

Math       99
English    98
History    97
Name: Grades for x, dtype: int64

In [11]:
#sereiss attibutes 
marks

Math       99
English    98
History    97
Name: Grades for x, dtype: int64

In [12]:
#size of the series
marks.size

3

In [13]:
#name of the series
marks.name

'Grades for x'

In [14]:
#data type of the series
marks.dtype

dtype('int64')

In [15]:
# isunique return true if all values are unique
marks.is_unique

True

In [16]:
#getting the index of the series
marks.index

Index(['Math', 'English', 'History'], dtype='object')

In [17]:
# getting the values of the series
marks.values

array([99, 98, 97])

In [22]:
#sereis using read_csv

subs = pd.read_csv('/Users/I578070/Desktop/100DaysML/Datasets/datasets-session-16/subs.csv')
subs

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [25]:
cricData = pd.read_csv('/Users/I578070/Desktop/100DaysML/Datasets/datasets-session-16/kohli_ipl.csv',index_col='match_no')
cricData

          runs
match_no
1            1
2           23
3           13
4           12
5            1
...        ...
211          0
212         20
213         73
214         25
215          7

[215 rows x 1 columns]

In [28]:
bollywood = pd.read_csv('/Users/I578070/Desktop/100DaysML/Datasets/datasets-session-16/bollywood.csv',index_col='movie')
bollywood

                                                  lead
movie
Uri: The Surgical Strike                 Vicky Kaushal
Battalion 609                              Vicky Ahuja
The Accidental Prime Minister (film)       Anupam Kher
Why Cheat India                          Emraan Hashmi
Evening Shadows                       Mona Ambegaonkar
...                                                ...
Hum Tumhare Hain Sanam                  Shah Rukh Khan
Aankhen (2002 film)                   Amitabh Bachchan
Saathiya (film)                           Vivek Oberoi
Company (film)                              Ajay Devgn
Awara Paagal Deewana                      Akshay Kumar

[1500 rows x 1 columns]

In [29]:
type(bollywood)

pandas.core.frame.DataFrame

In [ ]:
#top 5 rows of the dataframe
subs.head()

   Subscribers gained
0                  48
1                  57
2                  40
3                  43
4                  44

In [32]:
#bottom 5 rows of the dataframe
subs.tail()

     Subscribers gained
360                 231
361                 226
362                 155
363                 144
364                 172

In [ ]:
#randomly selecting 5 rows from the dataframe
subs.sample(5)

     Subscribers gained
210                  97
109                  65
7                    40
299                 157
136                  93

In [34]:
#value counts : counts the number of unique values in a series
bollywood.value_counts()

lead
Akshay Kumar        48
Amitabh Bachchan    45
Ajay Devgn          38
Salman Khan         31
Sanjay Dutt         26
                    ..
Kashmira Shah        1
Kartik Elangovan     1
Karisma Kapoor       1
Karan Sharma         1
Zulfi Sayed          1
Name: count, Length: 566, dtype: int64

In [ ]:
#sort values : sorts the values in a series #inplace = True makes changes in the original dataframe
cricData.sort_values(by='runs' ,ascending=False)

          runs
match_no
128        113
126        109
123        108
164        100
120        100
...        ...
93           0
211          0
130          0
8            0
135          0

[215 rows x 1 columns]

In [ ]:
#sort index : sorts the index of the series
bollywood.sort_index(ascending=False) #decending order
#this also has inplace = True

                                        lead
movie
Zor Lagaa Ke...Haiya!          Meghan Jadhav
Zokkomon                     Darsheel Safary
Zindagi Tere Naam         Mithun Chakraborty
Zindagi Na Milegi Dobara      Hrithik Roshan
Zindagi 50-50                    Veena Malik
...                                      ...
2 States (2014 film)            Arjun Kapoor
1971 (2007 film)              Manoj Bajpayee
1920: The Evil Returns           Vicky Ahuja
1920: London                   Sharman Joshi
1920 (film)                 Rajniesh Duggall

[1500 rows x 1 columns]

In [38]:
subs.count() #counts the number of non-null values in each column

Subscribers gained    365
dtype: int64

In [39]:
#sum : returns the sum of the values in a series
subs.sum() #sum of all the values in the series

Subscribers gained    49510
dtype: int64

In [40]:
#mean : returns the mean of the values in a series
subs.mean() #mean of all the values in the series

Subscribers gained    135.643836
dtype: float64

In [41]:
#median : returns the median of the values in a series
subs.median() #median of all the values in the series

Subscribers gained    123.0
dtype: float64

In [43]:
#mode : returns the mode of the values in a series
subs.mode() #mode of all the values in the series

   Subscribers gained
0                 105

In [44]:
#min : returns the minimum value in a series
subs.min() #minimum value in the series

Subscribers gained    33
dtype: int64

In [46]:
#max : returns the maximum value in a series
subs.max() #maximum value in the series

Subscribers gained    396
dtype: int64

In [47]:
#describe : returns the summary of the series
subs.describe() #summary of the series

       Subscribers gained
count          365.000000
mean           135.643836
std             62.675023
min             33.000000
25%             88.000000
50%            123.000000
75%            177.000000
max            396.000000

In [ ]:
x = pd.Series([11,23,45,67,89])
x[1] #accessing the value at index 1 here negative indexing is not allowed

23

In [50]:
#slicing the series
cricData[5:16]  #slicing the series from index 5 to 16

          runs
match_no
6            9
7           34
8            0
9           21
10           3
11          10
12          38
13           3
14          11
15          50
16           2

In [51]:
#negative indexing
cricData[-5:] #slicing the series from index -5 to end

          runs
match_no
211          0
212         20
213         73
214         25
215          7

In [52]:
marks

Math       99
English    98
History    97
Name: Grades for x, dtype: int64

In [53]:
marks[1] = 100 #updating the value at index 1

/var/folders/gm/nbsrp6ks1gnb1c4z3v9rvb4r0000gn/T/ipykernel_74408/899055184.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  marks[1] = 100 #updating the value at index 1

In [54]:
marks

Math        99
English    100
History     97
Name: Grades for x, dtype: int64

In [ ]:
#what if an inndex does not exist
marks['sst'] = 100 # it adds a new index to the series

In [57]:
marks

Math        99
English    100
History     97
sst        100
Name: Grades for x, dtype: int64

Series with python functionalities

In [58]:
#len/type/dir/sorted/min/max

print(len(marks)) #length of the series
print(type(marks)) #type of the series
print(dir(marks)) #attributes of the series
print(sorted(marks)) #sorted values of the series
print(min(marks)) #minimum value of the series
print(max(marks)) #maximum value of the series

4
<class 'pandas.core.series.Series'>
['English', 'History', 'Math', 'T', '_AXIS_LEN', '_AXIS_ORDERS', '_AXIS_TO_AXIS_NUMBER', '_HANDLED_TYPES', '__abs__', '__add__', '__and__', '__annotations__', '__array__', '__array_priority__', '__array_ufunc__', '__bool__', '__class__', '__column_consortium_standard__', '__contains__', '__copy__', '__deepcopy__', '__delattr__', '__delitem__', '__dict__', '__dir__', '__divmod__', '__doc__', '__eq__', '__finalize__', '__float__', '__floordiv__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__getstate__', '__gt__', '__hash__', '__iadd__', '__iand__', '__ifloordiv__', '__imod__', '__imul__', '__init__', '__init_subclass__', '__int__', '__invert__', '__ior__', '__ipow__', '__isub__', '__iter__', '__itruediv__', '__ixor__', '__le__', '__len__', '__lt__', '__matmul__', '__mod__', '__module__', '__mul__', '__ne__', '__neg__', '__new__', '__nonzero__', '__or__', '__pandas_priority__', '__pos__', '__pow__', '__radd__', '__rand__', '__rdivmod__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rmatmul__', '__rmod__', '__rmul__', '__ror__', '__round__', '__rpow__', '__rsub__', '__rtruediv__', '__rxor__', '__setattr__', '__setitem__', '__setstate__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__weakref__', '__xor__', '_accessors', '_accum_func', '_agg_examples_doc', '_agg_see_also_doc', '_align_for_op', '_align_frame', '_align_series', '_append', '_arith_method', '_as_manager', '_attrs', '_binop', '_can_hold_na', '_check_inplace_and_allows_duplicate_labels', '_check_is_chained_assignment_possible', '_check_label_or_level_ambiguity', '_check_setitem_copy', '_clear_item_cache', '_clip_with_one_bound', '_clip_with_scalar', '_cmp_method', '_consolidate', '_consolidate_inplace', '_construct_axes_dict', '_construct_result', '_constructor', '_constructor_expanddim', '_constructor_expanddim_from_mgr', '_constructor_from_mgr', '_data', '_deprecate_downcast', '_dir_additions', '_dir_deletions', '_drop_axis', '_drop_labels_or_levels', '_duplicated', '_find_valid_index', '_flags', '_flex_method', '_from_mgr', '_get_axis', '_get_axis_name', '_get_axis_number', '_get_axis_resolvers', '_get_block_manager_axis', '_get_bool_data', '_get_cacher', '_get_cleaned_column_resolvers', '_get_index_resolvers', '_get_label_or_level_values', '_get_numeric_data', '_get_rows_with_mask', '_get_value', '_get_values_tuple', '_get_with', '_getitem_slice', '_gotitem', '_hidden_attrs', '_indexed_same', '_info_axis', '_info_axis_name', '_info_axis_number', '_init_dict', '_init_mgr', '_inplace_method', '_internal_names', '_internal_names_set', '_is_cached', '_is_copy', '_is_label_or_level_reference', '_is_label_reference', '_is_level_reference', '_is_mixed_type', '_is_view', '_is_view_after_cow_rules', '_item_cache', '_ixs', '_logical_func', '_logical_method', '_map_values', '_maybe_update_cacher', '_memory_usage', '_metadata', '_mgr', '_min_count_stat_function', '_name', '_needs_reindex_multi', '_pad_or_backfill', '_protect_consolidate', '_reduce', '_references', '_reindex_axes', '_reindex_indexer', '_reindex_multi', '_reindex_with_indexers', '_rename', '_replace_single', '_repr_data_resource_', '_repr_latex_', '_reset_cache', '_reset_cacher', '_set_as_cached', '_set_axis', '_set_axis_name', '_set_axis_nocheck', '_set_is_copy', '_set_labels', '_set_name', '_set_value', '_set_values', '_set_with', '_set_with_engine', '_shift_with_freq', '_slice', '_stat_function', '_stat_function_ddof', '_take_with_is_copy', '_to_latex_via_styler', '_typ', '_update_inplace', '_validate_dtype', '_values', '_where', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'apply', 'argmax', 'argmin', 'argsort', 'array', 'asfreq', 'asof', 'astype', 'at', 'at_time', 'attrs', 'autocorr', 'axes', 'backfill', 'between', 'between_time', 'bfill', 'bool', 'case_when', 'clip', 'combine', 'combine_first', 'compare', 'convert_dtypes', 'copy', 'corr', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'div', 'divide', 'divmod', 'dot', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtype', 'dtypes', 'duplicated', 'empty', 'eq', 'equals', 'ewm', 'expanding', 'explode', 'factorize', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'flags', 'floordiv', 'ge', 'get', 'groupby', 'gt', 'hasnans', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'index', 'infer_objects', 'info', 'interpolate', 'is_monotonic_decreasing', 'is_monotonic_increasing', 'is_unique', 'isin', 'isna', 'isnull', 'item', 'items', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'list', 'loc', 'lt', 'map', 'mask', 'max', 'mean', 'median', 'memory_usage', 'min', 'mod', 'mode', 'mul', 'multiply', 'name', 'nbytes', 'ndim', 'ne', 'nlargest', 'notna', 'notnull', 'nsmallest', 'nunique', 'pad', 'pct_change', 'pipe', 'plot', 'pop', 'pow', 'prod', 'product', 'quantile', 'radd', 'rank', 'ravel', 'rdiv', 'rdivmod', 'reindex', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'repeat', 'replace', 'resample', 'reset_index', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'searchsorted', 'sem', 'set_axis', 'set_flags', 'shape', 'shift', 'size', 'skew', 'sort_index', 'sort_values', 'squeeze', 'sst', 'std', 'struct', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dict', 'to_excel', 'to_frame', 'to_hdf', 'to_json', 'to_latex', 'to_list', 'to_markdown', 'to_numpy', 'to_period', 'to_pickle', 'to_sql', 'to_string', 'to_timestamp', 'to_xarray', 'transform', 'transpose', 'truediv', 'truncate', 'tz_convert', 'tz_localize', 'unique', 'unstack', 'update', 'value_counts', 'values', 'var', 'view', 'where', 'xs']
[97, 99, 100, 100]
97
100

In [59]:
list(marks) #converting the series to a list

[99, 100, 97, 100]

In [61]:
dict = marks.to_dict() #converting the series to a dictionary

In [62]:
dict

{'Math': 99, 'English': 100, 'History': 97, 'sst': 100}

In [63]:
#membership operator
print('Math' in marks) #True

True